<template>
  <b-modal
    id="instructionsModal"
    title="Краткая инструкция"
    size="lg"
    ok-title="Все ясно!"
    ok-only
  >
    <p>
      Данная страничка является улучшенной (на мой взгляд автора) версией
      <a
        target="_blank"
        href="http://moex.com/ru/derivatives/open-positions.aspx"
        >официальной статистики</a
      >
      по открытым позициям на ММВБ. Основная цель для меня была - знакомство с
      некоторыми web технологиями и этот мини проект показался хорошим
      кандидатом на эту роль. Поэтому, если у вас есть идеи по улучшению ее
      практической ценности - пишите, рад буду любым отзывам ;) Так же, не
      являясь специалистом по верстке, я попытался выжать из себя максимум для
      приемлемого отображения на различных мобильных устройствах, но результат
      еще далек от совершенства ))
    </p>
    <br />
    <h5>Открытые позиции на дату</h5>
    <p>
      Необходимо выбрать нужный инструмент и дату и нажать кнопку
      <strong>Показать</strong>. Комбобокс поможет найти нужный инструмент -
      просто начните вводить его имя. Круговые диаграммы соответствуют каждой
      строке заполненой таблицы, после загрузки - это первая строка. Для
      визуализации выбранной строки необходимо кликнуть на ней.
    </p>
    <h5>Динамика открытых позиций</h5>
    <p>
      Дает возможность проследить изменение показателя "Количество контрактов" в
      разрезе физ и юрлиц за период. А так же сопоставить с изменением курса
      доллара (ЦБ). Первый запрос за период может подтормаживать и график курса
      USD появится с задержкой.
    </p>
    <p>
      <strong>upd от 27.11.2016:</strong> На график курса доллара добавлены
      данные о цене закрытия торгов по инструменту USDRUB_TOM. В этом наборе
      данных отсутствует последний торговый день (если запрошен в периоде),
      похоже, это особенности сервиса ММВБ, выясняю.
    </p>
    <br />
    <p>
      ps: данный сайт живет пока на самом простом тарифном плане
      хостинг-провайдера, поэтому просьба проявлять терпение к возможным
      задержкам и "задумчивости" :)
    </p>
  </b-modal>
</template>
